---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
source: html/e1108e3b-87c1-2db4-69c2-48b2c40b61b9.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength

A constraint that can be applied to a RebarShapeDefinitionByArc
 and drives the height of the arc.

## Syntax (C#)
```csharp
public class RebarShapeConstraintSagittaLength : RebarShapeConstraint
```